
# s = {"周润发","大润发","王润发","周润发"} # 无序不重复的
#
# print(s)
#
# # 唯一能用到的点 就是去重复
#
# lst = ["麻将", "老虎机", "骰子", "扑克", "麻将", "老虎机", "骰子", "扑克"]
# s = set(lst)
# # 去重复
# print(s) # {'骰子', '麻将', '老虎机', '扑克'}
#
# lst1 = list(s)
# # 将集合变回列表
# print(lst1) # ['骰子', '麻将', '扑克', '老虎机'] ，顺序是无序的

s = {"周润发", "大润发", "王润发", "李润发"} # 集合是无序的
# s.add("刘嘉玲")
# s.update(["李嘉欣"]) # 满足迭代更新
# ret = s.pop() # 随机删除一项
#
# print(s) # {'周润发', '大润发', '刘嘉玲', '李嘉欣', '王润发', '李润发'}
# print(ret) # 大润发 删除的是大润发

s.remove("大润发") # 删除 大润发
print(s) # {'王润发', '周润发', '李润发'}

# 集合与字典都是没有索引和切片的