
# 协程的功能，使线程与进程的效率更高
# 协程：一个线程执行多任务的并发,在多个任务之间来回跳跃
# 通过生成器来回切换，也不会执行相同的代码，保证程序的运行效率，一个线程完成了两个任务之间的来回切换

from threading import Thread
import time


def f1():
    for i in range(10):
        time.sleep(0.5)
        print("f1>>>", i)
        yield  # 保存为生成器

def f2():
    g = f1()  # 实例化生成对象
    for i in range(10):
        time.sleep(0.5)
        print("f2>>>", i)
        next(g)

f1()  # f = f1() 实例化以后，不对程序进行执行
f2()

# f2>>> 0
# f1>>> 0
# f2>>> 1
# f1>>> 1
# f2>>> 2
# f1>>> 2
# f2>>> 3
# f1>>> 3
# f2>>> 4
# f1>>> 4
# f2>>> 5
# f1>>> 5
# f2>>> 6
# f1>>> 6
# f2>>> 7
# f1>>> 7
# f2>>> 8
# f1>>> 8
# f2>>> 9
# f1>>> 9




